"auto";

var launchResult=launchApp("学习强国");
if(!launchResult){
    toast('你还没有安装学习强国');
}

sleep(10000);

setScreenMetrics(1080, 1920);

//设置循环，共三次
var i = 1;

while(i <= 3){

//打开文章
click(586, 812);//点击第一个大文章
sleep(2000);//等待文章打开

//滑动
swipe(508, 1470, 467, 490, 2000);//滑动
sleep(30000);
swipe(565, 1533, 480, 502, 2600);//二次滑动
sleep(30000);

//分享
click(992, 180);//点击那三个点
sleep(2000);//别忘了等待
click(132, 950);//选择学习强国好友
sleep(2000);//还是要等待
click(416, 919);//选择第一个用户
sleep(2000);//耐心等待。。。
click(856, 1200);//确认发送

sleep(2000);//等待，等待，等待。。。

/*
//发表评论 默认关闭，删去注释符号启用
//本功能为测试功能，目前只适用于百度输入法。如不想使用请用"//"注释掉

swipe(564, 825, 564, 825, 3000);//长按文字
sleep(2000);//最好是要再等会儿
click(356, 738);//选择"复制"
sleep(2000);//据说程序猿们都是慢吞吞的。。。
click(445, 1730);//点击文本框
sleep(2000);//但程序猿们写起代码来还是很高效的
click(905, 905);//点击复制弹窗，仅适用于百度输入法
sleep(2000);//还有战斗民族写起代码来。。。
click(1002, 784);//点击发布

sleep(2000);
*/
//退出
click(85, 172);

sleep(2000);

//切换文章
swipe(864, 618, 195, 743, 2000);

sleep(2000);

i++;
}